backend/controllers/UserController.php

SELECT COUNT(*) FROM `user`
SELECT * FROM `user` ORDER BY `id` LIMIT 10
---
    public function actionIndex()
    {
        $query=User::find();
        $total=$query->count();
        $page=new Pagination([
            'totalCount'=>$total,
            'defaultPageSize'=>10,
        ]);
        $model=$query->offset($page->offset)->limit($page->limit)->orderBy(['id'=>SORT_ASC])->all();

INSERT INTO `user` (`username`, `status`, `password_hash`, `created_at`, `updated_at`) VALUES ('hcxiao', 10, '$2y$13$V61albxbTlfMosj2gqtI5..bK7G7tyLttPKmwCEezPyiYiZQRznBe', 1511579751, 1511579751)
---
    public function actionAdd()
    {
        $model = new User();
        if ($model->load(\Yii::$app->request->post())) {
            if ($model->validate()) {
                $hash=\Yii::$app->security->generatePasswordHash($model->password);
                $model->password_hash=$hash;
                $model->save();

SELECT * FROM `user` WHERE `id`='1'
---
    public function actionEdit($id='')
    {
        if ($post=\Yii::$app->request->post()) {
            $model = User::findOne(['id' => $post['User']['id']]);